icc/05_string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-17 Thu 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org130acd2">1. La clase String</a>
<ul>
<li><a href="#org11d3369">1.1. Concatenación</a></li>
<li><a href="#org0138d9a">1.2. To Lower/Upper Case</a></li>
<li><a href="#org0fb154f">1.3. Equals</a></li>
<li><a href="#org66c3531">1.4. Length</a></li>
<li><a href="#org85c9bd5">1.5. Char at</a></li>
<li><a href="#org90d774f">1.6. Substring</a></li>
<li><a href="#orgbce9418">1.7. Index Of</a></li>
<li><a href="#orgcde9495">1.8. Split</a></li>
<li><a href="#org755ec56">1.9. Starts/Ends with</a></li>
<li><a href="#org64a8dac">1.10. Replace</a></li>
<li><a href="#orgacd82f0">1.11. Problema 1: Correo</a></li>
<li><a href="#org7a57095">1.12. Problema 2: Reversa</a></li>
<li><a href="#org7b7fda3">1.13. Problema 3: Palíndromo</a></li>
<li><a href="#org01e8a99">1.14. Problema 4: Contraseña</a></li>
<li><a href="#org3daf98f">1.15. Problema 5: Conteo</a></li>
<li><a href="#org5edf198">1.16. Problema 6: Versos</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org130acd2" class="outline-2">
<h2 id="org130acd2"><span class="section-number-2">1.</span> La clase String</h2>
<div class="outline-text-2" id="text-1">
<p>
Hemos visto rápidamente que si quieremos guardar texto utilizamos el
<i>objeto</i> llamado <code>String</code> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = input.nextLine();
</pre>
</div>

<p>
Sin embargo, una <i>string</i> no se limita a solo recibir cadenas. Es más,
<span class="underline">cualquier información que contenga 0 o más caracteres ya sean letras
números o símbolos</span> podemos guardarlos en un <i>string</i> y no hay límites
cercanos para su longitud.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris aliquam, metus ac rutrum cursus, nunc libero imperdiet sapien, vel venenatis purus magna sed mi."</span>
</pre>
</div>

<p>
Datos de diferente índole son guardados como cadenas
</p>

<ul class="org-ul">
<li>Correo electrónico</li>
<li>Nombres, apellidos</li>
<li>Países</li>
<li>CURP, RFC</li>
<li>Contraseñas (hashes)</li>
<li>Descripciones, libros</li>
<li>Páginas WEB</li>
<li>Comentarios de redes sociales</li>
<li>y mucho más!</li>
</ul>


<p>
Porque eso es lo que es, una <b>cadena de caractéres</b>, es decir un
<b>grupo de símbolos</b> que llevan un orden. Y cada <i>elemento</i> de la
cadena es un cáracter de tipo <i>char</i>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">L</td>
<td class="org-left">o</td>
<td class="org-left">r</td>
<td class="org-left">e</td>
<td class="org-left">m</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">i</td>
<td class="org-left">p</td>
<td class="org-left">s</td>
<td class="org-left">u</td>
<td class="org-left">m</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">d</td>
<td class="org-left">o</td>
<td class="org-left">l</td>
<td class="org-left">o</td>
<td class="org-left">r</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s</td>
<td class="org-left">i</td>
<td class="org-left">t</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">m</td>
<td class="org-left">e</td>
<td class="org-left">t</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
En esta sección veremos los métodos más utilizados de la clase
<code>String</code>.  Es de suma importancia escribir el <code>.</code> (punto) y los <code>()</code>,
así como su argumento.
</p>
</div>
<div id="outline-container-org11d3369" class="outline-3">
<h3 id="org11d3369"><span class="section-number-3">1.1.</span> Concatenación</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Dadas 2 cadenas, podemos crear una nueva cadena con la información de
ambas utilizando el operador <code>+</code>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s1</span> = <span style="color: #deb887;">"Tacos"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s2</span> = <span style="color: #deb887;">"Dorados"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s3</span> = s1 + <span style="color: #deb887;">" "</span> + s2;
System.out.println(s3); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Tacos Dorados</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0138d9a" class="outline-3">
<h3 id="org0138d9a"><span class="section-number-3">1.2.</span> To Lower/Upper Case</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Convierte todos los caracteres a mayúsculas/minúsculas respectivamente
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Quien busca siempre encuentra"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">m</span> = s.toUpperCase();
System.out.println(m); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">QUIEN BUSCA SIEMPRE ENCUENTRA</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0fb154f" class="outline-3">
<h3 id="org0fb154f"><span class="section-number-3">1.3.</span> Equals</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Una cadena es igual <i>en contenido</i> a otra cadena utilizando el método
equals
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s1</span> = <span style="color: #deb887;">"almeja"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s2</span> = <span style="color: #deb887;">"ALMEJA"</span>;
System.out.println(s1.equals(s2)); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">False
</span>
s1 = s1.toUpperCase();
System.out.println(s1.equals(s2)); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">True</span>
</pre>
</div>

<p>
No utilizamos el operador <code>==</code>, ya que <code>s1</code> y <code>s2</code> son dos <i>objetos</i>
que ocupan diferentes direcciones en memoria, por lo que <i>no son
<b>exactamente</b> el mismo</i>, pero sí pueden contener el mismo nombre.
</p>
</div>
</div>
<div id="outline-container-org66c3531" class="outline-3">
<h3 id="org66c3531"><span class="section-number-3">1.4.</span> Length</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Nos dice el número de caracteres que hay en una cadena.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris aliquam, metus ac rutrum cursus, nunc libero imperdiet sapien, vel venenatis purus magna sed mi."</span>;
System.out.println(s.length()); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">160</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org85c9bd5" class="outline-3">
<h3 id="org85c9bd5"><span class="section-number-3">1.5.</span> Char at</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Nos da el <i>char</i> que está en la posición <i>i</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Hoy no f&#237;o, ma&#241;ana s&#237;"</span>;
<span style="color: #98f5ff;">char</span> <span style="color: #4eee94;">c</span> = s.charAt(0);
System.out.println(c); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">H
</span>c = s.charAt(14);
System.out.println(c); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">&#241;</span>
</pre>
</div>

<p>
Si el índice está fuera de la longitud de la cadena, o es negativo
dará un error, por ejemplo
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Hoy no f&#237;o, ma&#241;ana s&#237;"</span>;
<span style="color: #98f5ff;">char</span> <span style="color: #4eee94;">c</span> = s.charAt(100);
System.out.println(c); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">????
</span>
</pre>
</div>

<p>
<b>Nota</b>: La posición de caracteres empieza en 0 hasta la longitud-1
</p>
</div>
</div>
<div id="outline-container-org90d774f" class="outline-3">
<h3 id="org90d774f"><span class="section-number-3">1.6.</span> Substring</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Dados dos índices \(i, f\) en el rango de la longitud de la cadena, nos
corta la cadena desde el indice inicio hasta el índice final-1.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">"Pepe pecas pica papas con un pico"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">t</span> = s.substring(7, 19);
System.out.println(t); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">"cas pica pap"</span>
</pre>
</div>

<p>
Si el índice está fuera de la longitud de la cadena, o es negativo
dará un error, además el primer índice debe ser <i>menor o igual</i> que el
segundo índice.
</p>
</div>
</div>
<div id="outline-container-orgbce9418" class="outline-3">
<h3 id="orgbce9418"><span class="section-number-3">1.7.</span> Index Of</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Nos dice si <i>esta</i> cadena contiene la cadena <i>pasada como argumento</i>.
Si sí está, nos da el índice del lugar donde se encuentra, si no, nos
da <code>-1</code>
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">esta</span> = <span style="color: #deb887;">"Todo lo ideal es irreal"</span>;
<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">indice</span> = esta.indexOf(<span style="color: #deb887;">"ideal"</span>);
System.out.println(indice); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">8
</span>indice = esta.indexOf(<span style="color: #deb887;">"peaches"</span>);
System.out.println(indice); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">-1</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcde9495" class="outline-3">
<h3 id="orgcde9495"><span class="section-number-3">1.8.</span> Split</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Nos divide la cadena, separado por la cadena que queramos separar y lo
guarda en un <i>Arreglo</i> donde cada elemento es guardado en un índice.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">data</span> = <span style="color: #deb887;">"Lorenzo,Gait&#225;n,12,2003,9.9"</span>
String[] separado = data.split(<span style="color: #deb887;">","</span>);
System.out.printl(<span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.Arrays.toString(separado));
<span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">["Lorenzo", "Gait&#225;n", "12", "2003", "9.9"] </span>
</pre>
</div>

<p>
Más adelante profundizaremos qué son los arreglos así como las
estructuras de datos, y por qué necesitamos escribir todo eso para
poder visualizarlo.
</p>
</div>
</div>
<div id="outline-container-org755ec56" class="outline-3">
<h3 id="org755ec56"><span class="section-number-3">1.9.</span> Starts/Ends with</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Nos dice si esta cadena <i>empieza</i> o <i>termina</i> con la cadena segunda.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">esta</span> = <span style="color: #deb887;">"Hola planeta tierra, eres un gran planeta"</span>;
<span style="color: #98f5ff;">boolean</span> <span style="color: #4eee94;">s</span> = esta.startsWith(<span style="color: #deb887;">"Hola"</span>);
System.out.println(s); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">True
</span>s = esta.endsWith(<span style="color: #deb887;">"planet"</span>);
System.out.println(s); <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">False</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org64a8dac" class="outline-3">
<h3 id="org64a8dac"><span class="section-number-3">1.10.</span> Replace</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Elimina todas las apariciones en esta cadena del primer parámetro para
reemplazarlas por la cadena del segundo parámetro.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">esta</span> = <span style="color: #deb887;">"Una mosca pegada en la pared"</span>;
<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">r</span> = esta.replace(<span style="color: #deb887;">"a"</span>, <span style="color: #deb887;">"e"</span>);
System.out.println(<span style="color: #deb887;">"Une mosce pegede en le pered"</span>);
r = esta.replace(<span style="color: #deb887;">" "</span>, <span style="color: #deb887;">""</span>);
System.out.println(<span style="color: #deb887;">"Unemoscepegedeenlepered"</span>);
</pre>
</div>

<p>
La cadena <code>""</code> es conocida como la <i>cadena vacía</i>, y es una cadena
válida, de longitud 0.
</p>
</div>
</div>
<div id="outline-container-orgacd82f0" class="outline-3">
<h3 id="orgacd82f0"><span class="section-number-3">1.11.</span> Problema 1: Correo</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Crear un programa que reciba una cadena por el usuario y nos diga si
contiene el caracter <code>@</code> y termine con el nombre de dominio <code>.com</code>
</p>
</div>
</div>
<div id="outline-container-org7a57095" class="outline-3">
<h3 id="org7a57095"><span class="section-number-3">1.12.</span> Problema 2: Reversa</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Dada una cadena por el usuario, imprimir la reversa de la misma cadena.
</p>
</div>
</div>
<div id="outline-container-org7b7fda3" class="outline-3">
<h3 id="org7b7fda3"><span class="section-number-3">1.13.</span> Problema 3: Palíndromo</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Una palabra es palíndromo si y solo si la palabra puede leerse igual
al derecho y al revés. Debes de hacer un <i>pre-procesamiento</i> de la
palabra ingresada como:
</p>

<ol class="org-ol">
<li>Debes quitar todos los espacios que contenga</li>
<li>Debes pasar todo a minúsculas</li>
<li><p>
Debes comprobar que al derecho y al revés sean lo mismo.
</p>

<p>
Ej: <i>Anita la gorda lagartona NO traga la droga latina</i> es
palíndromo
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org01e8a99" class="outline-3">
<h3 id="org01e8a99"><span class="section-number-3">1.14.</span> Problema 4: Contraseña</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Pedir al usuario que ingrese su nombre de usuario y su contraseña. La
contraseña debe coincidir con <code>123abc</code>.
</p>
</div>
</div>
<div id="outline-container-org3daf98f" class="outline-3">
<h3 id="org3daf98f"><span class="section-number-3">1.15.</span> Problema 5: Conteo</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Pedir al usuario un texto de más de 100 palabras. Contar el número de
palabras que existen en el texto.
</p>

<p>
Puedes encontrar texto generado aleatoriamente en la página de <a href="https://www.lipsum.com/">Lorem ipsum</a>
</p>
</div>
</div>
<div id="outline-container-org5edf198" class="outline-3">
<h3 id="org5edf198"><span class="section-number-3">1.16.</span> Problema 6: Versos</h3>
<div class="outline-text-3" id="text-1-16">
<p>
Leer una oración a través de la entrada, luego mostrar cada palabra
ingresada en una línea diferente.
</p>

<p>
Ej: <i>La mañana está fría.</i>
</p>

<p class="verse">
La<br />
mañana<br />
está<br />
fría.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-17 Thu 14:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
